[
{"transaction_id": "b9ffa22d-03eb-4431-b499-d5e62895fb7d", "app_name": "Adani Cement Connect", "date_of_review": "2024-10-01 00:00:00", "reviewer_name": "jitesh Vishindasani", "review_text": "its a very convenient app for dealers to palce the orders and watch each and every thing about there profile but i would like to suggest one thing to adani technical team that you should add lakshya points option also in this application so that dealers can see there lakshya points too in this application thank you", "rating_numeric": "5", "helpful_numeric": "2"},
{"transaction_id": "eff6a4f1-8c74-4bf9-a410-ae7cd217f865", "app_name": "Adani Cement Connect", "date_of_review": "2025-01-06 00:00:00", "reviewer_name": "Hitesh Sirvi", "review_text": "Application is not work at realtime", "rating_numeric": "1", "helpful_numeric": 0},
{"transaction_id": "5bcaced9-0f2a-4732-a18c-74ac1f1afa10", "app_name": "Adani Cement Connect", "date_of_review": "2024-11-21 00:00:00", "reviewer_name": "Md shamsad Alam", "review_text": "Helpful application in terms of credit limit invoice debit note etc", "rating_numeric": "5", "helpful_numeric": 0},
{"transaction_id": "b26dd326-4c35-402b-ac52-9f1bf3e71ba9", "app_name": "My AdaniGas", "date_of_review": "2024-10-25 00:00:00", "reviewer_name": "Saurabh Kansara", "review_text": "They send messages for feedback but when we click on it the page does not show. Why bother with all the messages then ? Also they close the complaint on their own and there is no way to know the conclusion they came up with. We end up wasting our time and resources to register any complaint. There is no way to ask for a physical bill in case we want one ! There are a lot to complaint for but that will also go waste.", "rating_numeric": "1", "helpful_numeric": "6"},
{"transaction_id": "aaff63c9-93fa-4232-8b4e-cdea2c471d02", "app_name": "My AdaniGas", "date_of_review": "2024-09-22 00:00:00", "reviewer_name": "Bhavesh", "review_text": "Disappointing Experience I recently used the Adani mobile app for a payment, and it was a frustrating experience. My money was debited, but the amount never credited to my gas connection account. Customer support has been unresponsive, and I'm left without resolution. The app needs significant improvements in reliability and customer service. Very disappointed!", "rating_numeric": "1", "helpful_numeric": "2"},
{"transaction_id": "7afb9ee3-db1a-43c1-9903-7d782a87ce0c", "app_name": "My AdaniGas", "date_of_review": "2023-08-15 00:00:00", "reviewer_name": "Chirag Khunt", "review_text": "Self-billing is not working at all. Every time, it fails to fetch the reading, no matter how clear your meter reading photo is. Also, I have tried the website for self-billing, but every time it shows, please crop the image, even if it shows only the meter reading. Self-billing is a totally useless feature of this app. Please update it.", "rating_numeric": "1", "helpful_numeric": "58"},
{"transaction_id": "8b81affd-347f-46cc-9e37-064d1ab3ba63", "app_name": "Adani Electricity", "date_of_review": "2023-07-01 00:00:00", "reviewer_name": "Ashiesh Vassu", "review_text": "The app is not working at all. Just to inform you, that my current version of app is updated but still there's no any improvement in app's functioning. Previously also it was not working now also it's not working. As soon as you open the app, one alert message will come and as soon as you press OK on it the app will shut down automatically. Please fix this technical glitch.", "rating_numeric": "1", "helpful_numeric": "148"},
{"transaction_id": "4fb4e405-04a3-486e-aae1-c5e5f860b4f7", "app_name": "Adani Electricity", "date_of_review": "2018-10-19 00:00:00", "reviewer_name": "A Google user", "review_text": "There is no difference. The app takes forever to validate user login. And once it manages to do that it just crashes/closes. If that doesn't happen then it takes forever to get data and finally fails with unable to connect with server error. The older Reliance app never had any such issues. Even after the update this new app is continuing to give these errors & that too on a high speed 50 MB v-fiber broadband. Frustrating!", "rating_numeric": "1", "helpful_numeric": "164"},
{"transaction_id": "9c9cc9fb-d8aa-4e7c-af5f-6c86818aee15", "app_name": "Adani Electricity", "date_of_review": "2021-12-29 00:00:00", "reviewer_name": "Vivek Pradeep", "review_text": "After the new update thr app keeps crashing before paying bills. Also, if you pay the bills from gpay directly or website the app shows paid bills as due. So there are chances that one may pay extra thanks to multiple notifications from different medium like small, app, gpay, website. But the payment is not reflected on all fronts to avoid double payment. Plus post payment the bills are shown still pending in the app as well.", "rating_numeric": "1", "helpful_numeric": "112"}
]